{
    "angularnew": {
        "title": "New AngularJS Website",
        "content": "<p>In order to improve my <strong>AngularJS</strong> skills, I decided to re-do the whole website in this technology. Most of the past functionalities were kept, with the exception of some animations that were either removed or improved.</p><p>I am now sure I absolutely love AngularJS, as it did eliminate all the redundant and hard to manage DOM manipulations. The website is now easier to update and any structural changes to subpages are easier to make as all the partials were moved from the JavaScript to separate HTML partials.</p>",
        "links": [
            ["Previous jQuery website's code", "https://github.com/diogomiguel/portfolio"]
        ]
    },
    "conference2": {
        "title": "Building better experiences with responsive JavaScript <small>(19/06/2014)</small>",
        "content": "<p><strong>&lsquo;Responsive design has thus far focused on using media queries to alter the way our site looks using CSS. The next step is to look at how we can progressively enhance our site based on the the features of the device.&rsquo;</strong></p><p>Very interesting talk by Jonathan Fielding on responsive JavaScript based techniques on using media queries to alter the way a website looks based on the features of the device. This talk went beyond what responsive CSS can offer, as <strong>&lsquo;there is more to building a great responsive site than simply how it looks.&rsquo;</strong></p><p>Accordingly to the speaker there are essentially two ways to change functionality: based on viewport size; based on the features the device supports.</p><p>Within the viewport size category two key browser API’s standout</p><ul class='simple'><li><strong>window.onresize</strong>: great browser support but has the potential to become messy very quickly; if a debouncer isn’t applied can create performance issues;</li><li><strong>window.matchMedia</strong>: enforces a more logical structure; browser support is not as broad as window.onresize (80.63%)</li></ul><p>Jonathan recommended two popular libraries, one for each approach, to help implement the aforementioned technique:</p><ul class='simple'><li><strong>SimpleStateManager</strong>: uses the resize event to add logical states which can be removed, updated and extended;</li><li><strong>Enquire.js</strong>: registers media queries with a handler that will fire when media query matches.</li></ul><p>On another note, to detect the features that a browser supports the speaker suggested Modernizr, which I was familiar with, which can be integrated with SSM.</p><p>I was already familiar with the presented approaches, however I was not familiar with the libraries presented to manage viewport size. Since then I’ve been using SSM in all my responsive projects that require a more advanced control of what elements of the UI is presented to a specific device/resolution.</p><p><a href='https://www.jonathanfielding.com/' rel='author' target='_blank'>Jonathan Fielding</a></p>",
        "links": [
            ["Conference on MeetUp website", "http://www.meetup.com/londonweb/events/140671892"]
        ]
    },
    "conference1": {
        "title": "Javascript Tools and Workflow <small>(09/04/2014)</small>",
        "content": "<p><strong>&lsquo;Responsive development has lead to an increase in the amount of code we are having to write for a website(…). This talk will explore how these tools can be used to optimize your workflow when working on developing a responsive site.&rsquo;</strong></p><p>Another super interesting talk by Jonathan Fielding about tools which can help developers to be faster and more productive, in this increasingly more demanding environment.</p><p>There are a multitude of tools to enhance web development across all parts of the workflow. Jonathan separated the classical development workflow in 4 big steps - <strong>scaffolding</strong>, <strong>abstraction</strong>, <strong>iteration</strong> and <strong>build</strong> - and picked a couple of those steps.</p><p>Scaffolding (setup a boilerplate and install dependencies):</p><ul class='simple'><li><strong>Yeoman</strong></li><li><strong>Grunt-init</strong></li></ul><p>Abstractions (abstract a way from the languages of the web):</p><ul class='simple'><li><strong>CSS Preprocessors: SASS and LESS</strong></li><li><strong>HTML abstractions: Markdown</strong></li></ul><p>Iteration (Save, refresh browser and back to editor steps):</p><ul class='simple'><li><strong>Bower</strong></li><li><strong>Grunt</strong> (which also can be used for the build step of the workflow)</li></ul><p>I was familiar with a few of the tools presented in the meeting and using some others in my day-to-day workflow (Grunt and Sass). Thanks to this conference I finally tried to integrate Yeoman and Bower in my workflow with great results.</p><p><a href='https://www.jonathanfielding.com/' rel='author' target='_blank'>Jonathan Fielding</a></p>",
        "links": [
            ["Conference on MeetUp website", "http://www.meetup.com/londonajax/events/173263912"]
        ]
    },
    "bmi": {
        "title": "BMI Calculator",
        "content": "<p>After implementing the <strong>BMI Calculator</strong> custom module in a <strong>Expression Engine</strong> project, I decided to clean up the code and release it to the public as a free add-on.</p><p>The Body Mass Index (or BMI) Calculator is a way of seeing if your weight is appropriate for your height.</p><p>This is just a server-side implementation. Client side validation is not mandatory but recommended.</p><p>Supports both imperial and metric units (defaults to metric if values for both are submitted).</p>",
        "links": [
            ["Plug-in on GitHub", "https://github.com/diogomiguel/ee_bmi_calculator"],
            ["Plug-in on Devot:ee", "http://devot-ee.com/add-ons/body-mass-index-calculator"]
        ]
    },
    "gatracker": {
        "title": "GA Tracker",
        "content": "<p>After implementing the <strong>GA Tracker</strong> custom module in a few <strong>Expression Engine</strong> projects, I decided to clean up the code and release it to the public as a free add-on.</p><p>Drop in solution which allows to track server-side events and data within Google Analytics, based on <a href='https://github.com/dancameron/server-side-google-analytics' target='_blank'>Server Side Google Analytics class</a></p>",
        "links": [
            ["Plug-in on GitHub", "https://github.com/diogomiguel/ee_ga_tracker"],
            ["Plug-in on Devot:ee", "http://devot-ee.com/add-ons/google-analytics-trackerr"]
        ]
    }
}