{
    "activa": {
        "imagepath": "assets/imgs/activa/big.jpg",
        "title": "Hosiery Selector",
        "description": "<p><strong>Activa Healthcare</strong> is the market leader in compression hosiery and the fastest growing woundcare company in the UK.</p><p>Activa provide an online product sizer but this isn't always accessible by HCPs on the move making house calls. Therefore I was approached with the challenge of building my first big mobile application that gave HCPs all this information at their finger tips.</p><p>To make sure the app was available to as many HCPs as possible, I decided to build a <strong>hybrid native / HTML5 application</strong> using <strong>jQuery mobile</strong> for the UI and <strong>PhoneGap</strong> for the compiling. This meant developing versions for Windows, Android, Blackberry and Apple mobile phones and tablets.</p><p>The app was optimised and re-factored having in mind each operating system requirements and UI limitations.<br />I was also charged with all the compatibility testing and deployment processes</p><p>The app has been promoted by the British Lymphology Society who promote professional standards of care and has also been entered in a number of industry awards.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [
            "Blackberry Webworks",
            "Eclipse",
            "HTML5/CSS3",
            "JavaScript/jQuery",
            "jQuery Mobile",
            "PhoneGap",
            "Sass",
            "Visual Studio Express",
            "XCode"
        ],
        "links": [
            ["App Store", "https://itunes.apple.com/gb/app/activa-hosiery-selector/id633402356?mt=8"],
            ["Windows Phone Apps", "http://www.windowsphone.com/en-gb/store/app/hosiery-selector/ae93972f-2c13-4ce9-8c60-5d172e6119e0"],
            ["Google Play", "https://play.google.com/store/apps/details"],
            ["Blackberry World", "http://appworld.blackberry.com/webstore/content/26689889/"]
        ]
    },
    "club8": {
        "imagepath": "assets/imgs/club8/big.jpg",
        "title": "Club8 Casino Online",
        "description": "<p><strong>Club8 Casino Online</strong> is free to play Australian simulated casino gaming website.<br />The development of their mobile-only new website from the ground up, was my first big assignment as an employee of GameAccount Network, and my first project from scratch running on a <strong>Java</strong> based technology stack.<br />The desktop website was developed in parallel as a separate entity.</p><p>As the website is very simple in terms of design and functionality, I took this as an opportunity to explore other tools like <strong>Susy Sass Grids</strong>, <strong>Sass Breakpoint</strong> and <strong>Compass</strong> as a <strong>Grunt</strong> task.</p><p>This website was also the starting point for a demo were I explored ways of merging mobile and desktop source codes using <strong>Modernizr Feature Detection</strong> with some custom tests.</p><p>Regardless of it's simplicity, this is a project I'm proud to showcase, as the final result is very performant, lightweight, up-to-date and compliant</p><p><small>developed as a GameAccount Network employee.</small></p>",
        "technologies": [           
            "Compass",
            "Feature Detection",
            "Grunt",
            "HTML5/CSS3",
            "Mercurial",
            "Modernizr",
            "JavaScript/jQuery",
            "JSTL",
            "Responsive",
            "RequireJS",
            "Sass",
            "Susy Grids"
        ],
        "links": [
            ["Link to Website", "https://m.club8casino.com.au"]
        ]
    },
    "fsi": {
        "imagepath": "assets/imgs/fsi/big.jpg",
        "title": "FreeStyle InsuLinx Switzerland",
        "description": "<p>As the biggest client of twentyfoursquare, most of my projects were for <strong>Abbott Diabetes Care</strong>, part of Abbott which is a global, broad-based health care company devoted to pharmaceuticals and medical products. The company employs more than 65,000 people and markets its products in more than 130 countries.</p><p>They needed a simple static website for the launch of their FreeStyle meter in Switzerland.<br />This is a one page website with simple parallax animations and a meter ordering form connection to a PHP interface/API</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [ 
            "HTML/CSS",
            "JavaScript/jQuery",
            "Parallax",
            "PHP",
            "Zend"
        ],
        "links": [
            ["Link to Website", "http://freestyleinsulinx.ch"]
        ]
    },
    "fsm": {
        "imagepath": "assets/imgs/freestyle/big.jpg",
        "title": "FreeStyle Blood Glucose Meters",
        "description": "<p>As the biggest client of twentyfoursquare, most of my projects were for <strong>Abbott Diabetes Care</strong>, part of Abbott which is a global, broad-based health care company devoted to pharmaceuticals and medical products. The company employs more than 65,000 people and markets its products in more than 130 countries.</p><p>Most of the tasks were improvements to their main website, which we inherited as a <strong>Zend PHP</strong> project developed by another company.<br />Amongst others, I re-factored the server-side code, validated the <strong>HTML</strong> accordingly to <strong>W3C</strong> requirements, developed new sections and implemented new UI elements.</p><p>As their 6 years old was technically outdated and not optimised for smaller devices, they urgently needed a brand new built-from-scratch <strong>responsive website</strong>.<br />I was actively present in all the stages of the project, from scoping to launch. The biggest challenge was to implement a CMS integration which enabled editors to update every single page of the website, while keeping some already existing functionality like the meter ordering forms. <strong>Expression Engine</strong> proved to be the right tool for the challenge, as it provided me the means to easily add custom functionality to the already existing code.<br />This was probably my hardest project to date given the size of the website and the high accessibility, usability and technical standards that were required to be met.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [ 
            "Ajax",
            "Expression Engine",
            "Git/SVN",
            "Grunt",
            "HTML/CSS",
            "JavaScript/jQuery",
            "Responsive",
            "Sass"
        ],
        "links": [
            ["Link to Website", "http://www.abbottdiabetescare.co.uk"]
        ]
    },
    "katereid" : {
        "imagepath": "assets/imgs/kate/big.jpg",
        "title": "Kate Reid",
        "description": "<p><strong>Kate Reid</strong> an award winning Director of Photography contacted me in order to update her <strong>Code Igniter</strong> based website.</p><p>I did not only build new pages, amend bugs and improve the existing UI, but also came up with a strategy to improve the SEO of the website based on the targetted keywords<br />The final result was an easier to navigate, better ranked website and therefore a very happy client.</p>",
        "technologies": [
            "Code Igniter",
            "HTML5/CSS",
            "JavaScript/jQuery",
            "PHP",
            "SEO"
        ],
        "links": [
            ["Link to Website", "http://www.katereiddop.com"]
        ]
    },
    "mfb": {
        "imagepath": "assets/imgs/mfb/big.jpg",
        "title": "M-F-B",
        "description": "<p><strong>MFB</strong> is a specialist shipping law firm provide a advice on shipping related litigation, arbitration and alternative dispute resolution.<br />I had the pleasure to do from scratch their new website.</p><p>It is a small website built in PHP using the <strong>in-house CMS</strong>.<br />During the development of this website, I had the chance to improve many features of the PHP bespoke CMS system, pushing them after to the master version.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [
            "CMS",
            "HTML5/CSS",
            "PHP"
        ],
        "links": [
            ["Link to Website", "http://m-f-b.co.uk/"]
        ]
    },
    "pm": {
        "imagepath": "assets/imgs/pm/big.jpg",
        "title": "Paulo Melo Portfolio",
        "description": "<p>Paulo Melo, a friend from Uni times, got in touch asking me to develop his portfolio website.<br />As a graphic designer, he produces all the design elements and hired a fellow web designer to produce most <strong>HTML/CSS</strong></p><p>My main job was to create all the <strong>JavaScript</strong>, improve the HTML/CSS code and create a small back end where he could update every aspect of the website.</p><p>I decided to use <strong>Symfony</strong> for the job, using this project as an opportunity to explore a new framework.<br />It proved to be the right decision, since the Symfony helpers provide a quick way to create a simple yet effective Back end admin panel, allowing me to save time by re-using generic modules and focus on other areas of the project.</p><p>This was by far the most enjoyable freelance work I've ever undertook and Paulo was very happy with the final result surpassing all his expectations.<br />Thus far he has recommended me to most of his friends and peers who are in need of some development help.</p>",
        "technologies": [
            "JavaScript/jQuery",
            "PHP",
            "Symfony"
        ],
        "links": []
    },
    "rut": {
        "imagepath": "assets/imgs/rut/big.jpg",
        "title": "Really Useful Theatres",
        "description": "<p><strong>Really Useful Theatres Group</strong> owns and operates six commercial theatres in the heart of London’s West End. The Group is wholly owned by Andrew Lloyd Webber.</p><p>I was engaged to build their new website from the ground up.<br />I decided to use <strong>Expression Engine</strong> for being a CMS solutions that offered the flexibility and the room for customisation needed by this project.<br />As part of the tracking requirements, I developed a EE module that enables <strong>Server-Side Google Analytics</strong> tracking. Later I released this as a free add-on for the devot:ee community</p><p>Most of the <strong>JavaScript</strong> was built in a <strong>modular DRY</strong> way, allowing to use the same classes to build all the carousels and timelines of the website</p><p>The results are great - the site bounce rate reduce by a third and visitors up from a few hundred to a few thousand per day!</p><p>I am working on the specification document for the mobile website</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [
            "Expression Engine",
            "Git",
            "Grunt",
            "HTML5/CSS3",
            "JavaScript/jQuery",
            "PHP",
            "Sass"
        ],
        "links": [
            ["Link to Website", "http://reallyusefultheatres.co.uk"],
            ["Link to GA Tracker module", "https://github.com/diogomiguel/ee_ga_tracker"]
        ]
    },
    "tindrum": {
        "imagepath": "assets/imgs/tindrum/big.jpg",
        "title": "Tin Drum",
        "description": "<p><strong>Tin Drum</strong> is a small independent, full service music consultancy.<br />I had the pleasure to built the redesign of their current website, that is now in beta version.</p><p>The new <strong>responsive website</strong> strongly relies on 2D imagery and parallaxing to highlight the creative nature of the company.<br />For the first time I used the <strong>use-init Yeoman generator</strong> to achieve an MVC modular front end, using <strong>RequireJS</strong> to smartly load the different <strong>JavaScript</strong> modules.<br /><strong>SimpleStateManager</strong> <strong>Bower</strong> plug-in was used to help with all the <strong>mediaqueries</strong> JavaScript manipulation and <strong>Skrollr</strong> to create pixel-aware, beautifully synchronized parallax animations</p><p><strong>Perch CMS</strong> proved to be the right CMS choice, due to it's simplicity and flexible integration.<br />Performance was a key aspect in this project and <strong>Grunt</strong> plug ins were used to minify, concat and optimise all aspects of the front end implementation</p><p>This joy of a project enabled me to deeply strengthen my front end skills, leaving both the client and me proud of the final result.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [           
            "Bower",
            "Git",
            "Grunt",
            "HTML5/CSS3",
            "JavaScript/jQuery",
            "JSON",
            "Parallax",
            "Perch CMS",
            "Responsive",
            "RequireJS",
            "Use-init",
            "Yeoman"
        ],
        "links": [
            ["Link to Website", "http://www.tindrummusic.co.uk"],
            ["Code examples on GitHub", "https://github.com/diogomiguel/t-drum"]
        ]
    },
    "twentyfoursquare": {
        "imagepath": "assets/imgs/24sq/big.jpg",
        "title": "Twentyfoursquare",
        "description": "<p>The previous website of the agency I am currently employed at - <strong>twentyfoursquare</strong> - was entirely built in Flash.<br />As we were getting more and more visits from mobile devices and clients searching for responsive solutions, it became clear we needed a more compatible approach.</p><p>The new site has been built to adapt to the size of the screen you're viewing it, i.e. optimising your experience regardless of your choice of platform.</p><p>There are four different sizes which should pretty much cover all devices. I've written <strong>mediaqueries</strong> to work out the width of the screen and serve the appropriate <strong>CSS</strong> for that window. The layout changes and any assets are resized accordingly.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [           
            "HTML5/CSS",
            "JavaScript/jQuery",
            "PHP",
            "Responsive"
        ],
        "links": [
            ["Link to Website", "http://24sq.com"]
        ]
    },
    "wct": {
        "imagepath": "assets/imgs/wct/big.jpg",
        "title": "Wound Care Today",
        "description": "<p><strong>Wound Care Today</strong> brings together UK and international media in one essential resource, offering a  window to all that is going on in the world of wounds, and they needed a strong online presence.<br />Firstly, a native iOS simple Ad-hoc app was built in order to collect pre-website launch registrations during a major industry related event.<br />Secondly, the <strong>responsive website</strong> was build, powered by the in-house <strong>PHP CMS</strong>.</p><p>The Wound Care Today app, even though it was a very simple one, it was my very first published iOS native app and one of my biggest challenges.<br />Learning <strong>Objective C</strong> was very enjoyable and massively improved my whole <strong>OOP</strong> understanding.</p><p>The website was built from scratch with PHP, including all the login and registration processes, as well as the data imports and the Back end.</p><p><small>developed as a twentyfoursquare employee.</small></p>",
        "technologies": [
            "HTML5/CSS",
            "JavaScript/jQuery",
            "Objective C",
            "PHP",
            "Responsive",
            "Sass"
        ],
        "links": [
            ["Link to Website", "http://woundcare-today.com"]
        ]
    },
    "whitedesk": {
        "imagepath": "assets/imgs/whitedesk/big.jpg",
        "title": "The White Desk",
        "description": "<p>Web portfolio for a fellow web designer friend, built around 2010 in <strong>Flash</strong> and <strong>ActionScript 3</strong></p><p>All graphics and animations were created by him. My goal was to put all the animations together in an updateable, creative web experience</p><p>All the elements are dynamically inserted in the animation through code, reserving the timeline for individual <strong>MovieClip</strong> stop-motion animations</p><p>It was hard-work but final result paid-off</p>",
        "technologies": [
            "ActionScript 3",
            "Flash"
        ],
        "links": [
            ["Link to Website", "http://thewhitedesk.com/"]
        ]
    }
}